app/controllers/lists_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`id` = 13)
---
  def show
    @list = List.find(params[:id])

INSERT INTO `lists` (`name`, `created_at`, `updated_at`, `level`, `user_id`, `view`, `num_calls`) VALUES(NULL, '2010-01-23 03:05:35', '2010-01-23 03:05:35', 1, 1, 'Printable', 25)
SELECT * FROM `lists` WHERE (user_id = 1)
SELECT * FROM `voters` WHERE (list_id is NULL AND level = 1) LIMIT 25
UPDATE `voters` SET `list_id` = 16, `last_updated` = '2010-01-22 19:08:41' WHERE `id` = 7
---
  def create
    # create the dataset
    @list = List.new(params[:list])
    @list.user_id = USERID

    # check to see if the save is successful
    success = @list && @list.save

    #if success.empty?
    #  flash[:error] = "There was a problem creating the list.  Please contact support."
    #  return false
    #end

    # pull list of voters
    @voters = Voter.find(:all, :limit => @list.num_calls, :conditions => ["list_id is NULL AND level = ?", @list.level])

    # update voters so we know they're checked out
    for voter in @voters
      voter.list_id = @list.id
      voter.last_updated = Time.now.strftime("%Y-%m-%d %H:%M:%S")
      voter.save

SELECT * FROM `lists` WHERE (`lists`.`id` = 13)
---
  def edit
    @list = List.find(params[:id])

SELECT * FROM `lists` WHERE (`lists`.`id` = 13)
UPDATE `lists` SET `updated_at` = '2010-01-23 02:59:32', `num_calls` = 25, `view` = 'Printable' WHERE `id` = 13
---
  def update
    @list = List.find(params[:id])
    if @list.update_attributes(params[:list])