app/controllers/questions_controller.rb

INSERT INTO `questions` (`created_at`, `updated_at`, `text`, `q_type`) VALUES('2010-01-20 18:35:14', '2010-01-20 18:35:14', 'Test question text', 'Radio')
---
  def create
    @question = Question.new(params[:question])
    success = @question && @question.save