app/controllers/responses_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`user_id` = 1) LIMIT 1
SELECT * FROM `voters` WHERE (`voters`.`list_id` = 1) LIMIT 1
SELECT * FROM `surveys` WHERE (`surveys`.`active` = 'Y') LIMIT 1
SELECT * FROM `questions` WHERE (`questions`.`survey_id` = 5)
---
  def index
    @responses = Response.new
    @list = List.find_by_user_id(USERID)
    @voters = Voter.find_all_by_list_id(@list.id)
    @survey = Survey.find_by_active('Y')
    @questions = Question.find_all_by_survey_id(@survey.id)

SELECT * FROM `responses` WHERE (`responses`.`id` = 1)
---
  def show
    @response = Response.find(params[:id])

INSERT INTO `responses` (`voter_id`, `question_id`, `created_at`, `updated_at`, `date`, `user_id`, `answer_id`, `cycle`) VALUES(NULL, NULL, '2010-01-25 02:06:29', '2010-01-25 02:06:29', NULL, NULL, NULL, NULL)
---
  def create
    @response = Response.new(params[:response])
    if @response.save

SELECT * FROM `answers` WHERE (`answers`.`question_id` = 2)
---
  def find_answers(id)
    @answers = Answer.find_all_by_question_id(id)