app/controllers/survey_replies_controller.rb

SELECT * FROM `lists` WHERE (`lists`.`user_id` = 1) LIMIT 1
---
  def index
    @list = List.find_by_user_id(USERID)

SELECT * FROM `survey_replies` WHERE (`survey_replies`.`id` = 1)
---
  def show
    @survey_replies = SurveyReply.find(params[:id])

SELECT * FROM `surveys` WHERE (`surveys`.`active` = 'Y') LIMIT 1
SELECT * FROM `questions` WHERE (`questions`.`survey_id` = 5)
SELECT * FROM `answers` WHERE (`answers`.`question_id` = 3)
---
  def new
    @voters = Voter.find_by_sql(
    ["SELECT * FROM voters WHERE list_id = ? AND voters.id NOT IN
      (SELECT voter_id FROM survey_replies WHERE user_id = ?)  LIMIT 1", params[:list], USERID])
    @previous_survey_replies = SurveyReply.find_by_sql(
    ["SELECT v.name, v.sex, v.party, v.phone, s.* FROM survey_replies s LEFT JOIN voters v
      on s.voter_id = v.id WHERE s.user_id = ? ORDER BY s.updated_at DESC LIMIT 5", USERID])
    @survey = Survey.find_by_active('Y')
    @questions = Question.find_all_by_survey_id(@survey.id)
    @survey_reply = SurveyReply.new
    for question in @questions do
      if question.mode == 'checkbox'
        @answers = Answer.find_all_by_question_id(question.id)

INSERT INTO `survey_replies` (`voter_id`, `created_at`, `updated_at`, `user_id`, `datetime`) VALUES(NULL, '2010-01-27 23:53:40', '2010-01-27 23:53:40', NULL, NULL)
---
  def create
    @survey_replies = SurveyReply.new(params[:survey_reply])
    if @survey_replies.save

SELECT * FROM `lists` WHERE (`lists`.`user_id` = 1) LIMIT 1
SELECT * FROM `survey_replies` WHERE (`survey_replies`.`id` = 39)
SELECT * FROM `voters` WHERE (`voters`.`id` = 58)
SELECT * FROM `surveys` WHERE (`surveys`.`active` = 'Y') LIMIT 1
SELECT * FROM `questions` WHERE (`questions`.`survey_id` = 6)
---
  def edit
    @list = List.find_by_user_id(USERID)
    @survey_reply = SurveyReply.find(params[:id])
    @voters = Voter.find(@survey_reply.voter_id)
    @previous_survey_replies = SurveyReply.find_by_sql(
    ["SELECT v.name, v.sex, v.party, v.phone, s.* FROM survey_replies s LEFT JOIN voters v
      on s.voter_id = v.id WHERE s.user_id = ? ORDER BY s.updated_at DESC LIMIT 5", USERID])
    @survey = Survey.find_by_active('Y')
    @questions = Question.find_all_by_survey_id(@survey.id)

SELECT * FROM `survey_replies` WHERE (`survey_replies`.`id` = 31)
---
  def update
    @survey_replies = SurveyReply.find(params[:id])

SELECT * FROM `answers` WHERE (`answers`.`question_id` = 6)
---
  def find_answers(id)
    @answers = Answer.find_all_by_question_id(id)