app/controllers/surveys_controller.rb

SELECT * FROM `surveys`
---
  def index
    @surveys = Survey.all

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
---
  def show
    @survey = Survey.find(params[:id])

INSERT INTO `surveys` (`name`, `open_script`, `created_at`, `updated_at`, `close_script`) VALUES('Test', 'Testing the opening script', '2010-01-22 03:02:10', '2010-01-22 03:02:10', 'Test closing script')
---
  def create
    @survey = Survey.new(params[:survey])
    if @survey.save

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
---
  def edit
    @survey = Survey.find(params[:id])

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 5)
UPDATE `surveys` SET `updated_at` = '2010-01-22 23:15:24', `active` = 'N' WHERE `id` = 5
---
  def active
    @survey = Survey.find(params[:id])
    @all_surveys = Survey.find(:all)

    # set all surveys to "N"
    for all_survey in @all_surveys do
      all_survey.active = "N"
      all_survey.save

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
UPDATE `surveys` SET `updated_at` = '2010-01-25 00:42:15', `close_script` = 'Closing script' WHERE `id` = 5
---
  def update
    @survey = Survey.find(params[:id])
    if @survey.update_attributes(params[:survey])

SELECT * FROM `surveys` WHERE (`surveys`.`id` = 1)
DELETE FROM `surveys` WHERE `id` = 1
---
  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy